app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "age", "deceased", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "11"], ["age", 32], ["deceased", true], ["created_at", "2024-07-10 16:30:41.169455"], ["updated_at", "2024-07-10 16:30:41.169455"]]
---
  def create
      @authors= Author.create(author_params)